RDSC-5979: Convert PrivateLink networking diagrams to Mermaid
